[
  {
    "image": "https://i.ibb.co.com/fd1qLhjC/insta.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "id": 1,
    "description": "Instagram is a dynamic social media platform that allows users to share photos, videos, and stories with friends, family, and followers. It offers creative tools, filters, and editing features to enhance visual content. Users can follow accounts, like posts, comment, and interact through direct messaging. It also supports reels and IGTV for longer videos, making it an ideal platform for self-expression, content discovery, and connecting with communities worldwide, whether for personal use, business promotion, or creative projects.",
    "size": 185,
    "reviews":"12M",
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 6700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nqBrpJ8W/download.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 2,
    "description": "Spotify is a popular music streaming service that provides access to millions of songs, podcasts, and curated playlists from artists around the world. Users can create their own playlists, explore personalized recommendations, and discover new music daily. The platform supports offline listening, high-quality audio streaming, and seamless integration across devices. It also offers social features to share music and podcasts with friends, making it a versatile tool for music lovers, content creators, and anyone seeking an immersive audio experience.",
    "size": 130,
    "reviews": "8.5M",
    "ratingAvg": 4.7,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 5100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/m3WFVKh/download-1.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 3,
    "description": "TikTok is a global platform for creating, sharing, and discovering short-form videos with entertaining music, creative effects, and trending filters. Users can engage with content through likes, comments, shares, and duets, while exploring a personalized feed powered by AI recommendations. TikTok is widely used for entertainment, education, and creative expression, enabling influencers and brands to reach a large audience. The app also encourages participation in challenges and viral trends, fostering community interaction and innovative content creation for users of all ages.",
    "size": 210,
    "reviews": "10M",
    "ratingAvg": 4.5,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/G4pJQKSN/download-2.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 4,
    "description": "YouTube is the world’s largest video-sharing platform where users can watch, upload, and interact with a vast variety of content. It provides tutorials, entertainment, live streams, music videos, vlogs, and educational material for audiences of all ages. Users can subscribe to channels, like, comment, and share videos, while creators can monetize their content and build communities. YouTube also offers features like playlists, offline downloads, and live streaming, making it an essential platform for both personal entertainment and professional content creation, accessible globally.",
    "size": 240,
    "reviews": "19M",
    "ratingAvg": 4.4,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 2200000 },
      { "name": "4 star", "count": 4200000 },
      { "name": "5 star", "count": 10400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TDbdb42x/download.jpg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms Inc.",
    "id": 5,
    "description": "WhatsApp Messenger is a widely used communication app that allows users to send instant messages, make voice and video calls, and share photos, videos, documents, and voice notes securely. With end-to-end encryption, it ensures privacy for personal and group conversations. Users can also create status updates, participate in communities, and use WhatsApp Web for desktop access. It is designed for global communication, connecting friends, family, and businesses easily while offering a reliable and fast messaging platform for all types of users.",
    "size": 95,
    "reviews": "17.5M",
    "ratingAvg": 4.8,
    "downloads": "8B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2800000 },
      { "name": "5 star", "count": 12400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tMRy3DRV/download-3.png",
    "title": "Facebook",
    "companyName": "Meta Platforms Inc.",
    "id": 6,
    "description": "Facebook is a social networking platform that enables users to connect with friends, family, and communities worldwide. Users can share posts, photos, videos, and live updates, while interacting through likes, comments, and messages. It also supports groups, events, and marketplace features, allowing people to join communities with similar interests or buy and sell items. Facebook serves as a hub for social interaction, entertainment, business promotion, and networking, making it a versatile platform for personal engagement, professional outreach, and global social connections.",
    "size": 220,
    "reviews": "23M",
    "ratingAvg": 4.2,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 1800000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 4200000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KxrLjBSx/download-1.jpg",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 7,
    "description": "Netflix is a leading streaming service offering a wide selection of movies, TV shows, documentaries, and original content for entertainment enthusiasts. Users can stream high-definition videos on multiple devices, create personalized watchlists, and explore content tailored to their preferences. It supports offline downloads, multi-profile management, and parental controls. Netflix continuously updates its library with exclusive originals and popular titles, making it an ideal platform for binge-watching, entertainment on-the-go, and exploring diverse genres for viewers of all ages and interests.",
    "size": 180,
    "reviews": "9.5M",
    "ratingAvg": 4.6,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 4900000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ymQqQDVp/download-4.png",
    "title": "Twitter (X)",
    "companyName": "X Corp.",
    "id": 8,
    "description": "Twitter, now known as X, is a microblogging platform for sharing real-time thoughts, updates, and news with followers. Users can post tweets, reply, like, retweet, and follow other accounts to stay informed about global events and trends. It supports threads, polls, spaces, and multimedia sharing, making it an interactive platform for conversation and information dissemination. X enables users to engage in public discussions, follow breaking news, and participate in communities, providing a dynamic space for opinions, updates, and networking worldwide.",
    "size": 120,
    "reviews": "8.9M",
    "ratingAvg": 4.0,
    "downloads": "1.5B",
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xtptm1vK/download-5.png",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "id": 9,
    "description": "LinkedIn is a professional networking platform that connects individuals, businesses, and organizations worldwide. Users can build professional profiles, showcase experience and skills, network with colleagues, and discover job opportunities. The platform supports content sharing, company pages, learning courses, and professional groups for career growth and industry insights. LinkedIn enables recruiters to find talent, businesses to build brand presence, and professionals to engage in knowledge sharing. It serves as a powerful tool for professional development, networking, and staying informed about industry trends.",
    "size": 140,
    "reviews": "5.7M",
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/6RqyTDNL/download-6.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 10,
    "description": "Snapchat is an innovative messaging app focused on sending temporary photos and videos called 'snaps' to friends and groups. It offers augmented reality (AR) filters, interactive lenses, and stories to share moments creatively. Users can chat, video call, and explore content through Discover and Spotlight features. Snapchat emphasizes privacy with ephemeral messages and encourages fun, spontaneous interactions. It is popular among younger audiences for social engagement, creative expression, and entertainment, while also supporting multimedia storytelling and immersive AR experiences for daily communication.",
    "size": 160,
    "reviews": "6.8M",
    "ratingAvg": 4.2,
    "downloads": "1.5B",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 1700000 },
      { "name": "5 star", "count": 2900000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rfbLnhZ2/download-7.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "id": 11,
    "description": "Pinterest is a visual discovery platform where users can find, save, and share creative ideas, inspirations, and lifestyle content. Users can browse pins, create boards, follow interests, and explore topics such as home decor, fashion, recipes, travel, and more. Pinterest encourages planning and creativity by allowing users to organize ideas and discover trending content. It serves as a source of inspiration for personal projects, professional creativity, and DIY solutions, while connecting a community of like-minded individuals passionate about visual exploration and idea sharing.",
    "size": 125,
    "reviews": "4.5M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YBRYQZ2b/download-8.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 12,
    "description": "Telegram is a secure and fast messaging app offering cloud-based messaging and multimedia sharing. Users can send texts, images, videos, and files of any size, while supporting group chats, channels, and bots for automated interactions. It provides end-to-end encryption for private communication and allows synchronization across multiple devices. Telegram emphasizes privacy, speed, and versatility, making it suitable for personal conversations, professional networking, and community engagement. It also offers advanced features such as polls, secret chats, and large group management for global users.",
    "size": 105,
    "reviews": "6.7M",
    "ratingAvg": 4.7,
    "downloads": "1.2B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 4200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1g0SSFL/download-9.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 13,
    "description": "Gmail is a widely used email platform providing secure, organized, and efficient communication. Users can send and receive emails, manage contacts, and categorize messages using labels, filters, and folders. Gmail supports attachments, integrates with Google Workspace apps, and offers features like spam filtering, search, and priority inbox. It also includes security measures such as two-factor authentication and phishing detection. Gmail is designed for personal and professional communication, enabling users to manage their inbox efficiently and stay connected across devices in a reliable and organized manner.",
    "size": 110,
    "reviews": "8.2M",
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 4400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PG9Y7VMX/download-2.jpg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 14,
    "description": "Google Maps is a comprehensive navigation platform that helps users explore the world and reach destinations efficiently. It provides turn-by-turn directions, real-time traffic updates, route planning, and public transport information. Users can search for businesses, landmarks, and points of interest, view street-level imagery, and read reviews. Google Maps also offers offline maps, personalized recommendations, and location sharing. It is widely used for travel planning, commuting, and discovering nearby places, making it an indispensable tool for individuals, tourists, and businesses alike.",
    "size": 190,
    "reviews": "9.7M",
    "ratingAvg": 4.6,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 5200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLwMJWxV/download-10.png",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 15,
    "description": "Amazon Shopping is an e-commerce platform that allows users to browse and purchase millions of products online with ease. It offers secure payments, fast delivery, order tracking, and customer reviews to help users make informed choices. The app supports wishlists, subscriptions, deals, and personalized recommendations. Amazon Shopping caters to a wide range of categories including electronics, fashion, groceries, and more. It is designed for convenience, enabling users to shop efficiently, compare products, and enjoy a seamless online shopping experience from anywhere, anytime.",
    "size": 150,
    "reviews": "10.5M",
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 5400000 }
    ]
  }
]
